/**
 * Created by war3_2 on 2017/3/6.
 */
/*
数据绑定：
----------------------------------------------------------------------------------------------------------------------
指令绑定【v-text、v-html】跟插值绑定【{{name}}】的区别：
    1、指令绑定的性能更优
    2、指令绑定依附于html标签
注：注意不要在 Vue.js 指令中使用双大括号或三大括号插值语法
----------------------------------------------------------------------------------------------------------------------
v-bind【需要参数，叙述绑定的熟悉名称】：将实例中的各种数据绑定到html属性当中
    例如：<img src="{{user.photo}}"/>      <img v-bind:src="user.photo"/>
v-on【需要参数，叙述绑定的函数名称】：将实例中的函数方法绑定到html元素当中
----------------------------------------------------------------------------------------------------------------------
注：由于v-bind和v-on都需要参数才有意思，因此vue提供了缩写形式
    例如：<a   v-bind:href="javascript:;"  v-on:click="dosomething">click me</a>
          <a   :href="javascript:;"  @click="dosomething">click me</a>
----------------------------------------------------------------------------------------------------------------------
绑定表达式：使用插值方式或者指令方式绑定的内容叫做绑定表达式【允许在绑定表达式后添加过滤器】
----------------------------------------------------------------------------------------------------------------------
计算属性：【使用构造选项中的computed声明计算属性】

*/
